Catalogs/фин_СпискиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_СпискиДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ТипыВходящихПоказателейБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаЭкземпляра</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСписковДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ТипыВходящихПоказателейБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ТипыВходящихПоказателейБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Числовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_СпискиДанных/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка=Истина Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтоГруппа Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Неопределено");
		Если ЗначениеЗаполнено(ТипПоказателя) И ИмяОбъекта<>"" Тогда
			Если ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Справочник Тогда
				База = "СправочникСсылка";
			ИначеЕсли ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Перечисление Тогда
				База = "ПеречислениеСсылка";
			ИначеЕсли ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов Тогда
				База = "ПланСчетовСсылка";
			ИначеЕсли ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета Тогда
				База = "ПланВидовРасчетаСсылка";
			КонецЕсли;
			Если Метаданные.НайтиПоПолномуИмени(СтрЗаменить(База,"Ссылка","")+"."+ИмяОбъекта)<>Неопределено Тогда
				ОписаниеТипа = Новый ОписаниеТипов(База+"."+ИмяОбъекта);
			Иначе
				ОписаниеТипа = Новый ОписаниеТипов("Неопределено");
			КонецЕсли;
		КонецЕсли;
		СсылкаЭкземпляра = ОписаниеТипа.ПривестиЗначение(Неопределено);
	КонецЕсли;
КонецПроцедуры
